name: "Siamese_LFW_test"
layers {
  name: "lfw"
  type: IMAGE_PAIR_DATA
  top: "data_a"
  top: "data_b"
  top: "label"
  image_pair_data_param {
    source: "lfw_tst_1_clean.txt"
    mean_file: "mean.binaryproto"
    relative_path: "../../data/lfw/"
    scale: 0.0039062
    batch_size: 73
  }
}
layers {
  type: IMPORT  
  import_param {
    source: "siamese_shared.prototxt"
    target: "" 
    ref { name: "bottom" value: "/data_a" }
  }
}
layers {
  type: IMPORT   
  import_param {   
    source: "siamese_shared.prototxt"
    target: "b"
    ref { name: "bottom" value: "/data_b" }
  }
}
layers {
  name: "distance"
  type: DISTANCE
  top: "distance"
  bottom: "relu4"
  bottom: "b/relu4"
  blobs_lr: 1.0
  blobs_lr: 1.0
  distance_param {
    num_output: 1
    weight_filler {  
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "gaussian"
      std: 0.01
    }
  }
}
layers {
  name: "accuracy"
  type: BINARY_ACCURACY
  bottom: "distance"
  bottom: "label"
  top: "accuracy"
}
